doc/latex/swfu/swfuthesis/readme.org
#+TITLE:     《西南林业大学本科毕业论文LaTeX模版》使用说明
#+AUTHOR:    王晓林
#+EMAIL:     wx672ster@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:nil toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

* 文件清单
  本模版的最新版本可以从 [[https://github.com/wx672/texmf/tree/master/doc/latex/swfu/swfcthesis/tutorial][github]] 下载。 模版目录中包含如下内容：
  - [[./swfuthesis.cls][*swfuthesis.cls*]] --- 是论文模版的class文件，它决定了论文的排版格式
  - [[./readme.html][*readme.html*]] --- 本说明文件
  - [[./tutorial][*tutorial*]] --- 小教程，同时也是一个标准模板。其中包括
    - [[file:tutorial/tutorial.tex][*tutorial.tex*]] --- 源文件
    - [[file:tutorial/tutorial.pdf][*tutorial.pdf*]] --- 编译好的PDF
    - [[file:tutorial/tutorial.bib][*tutorial.bib*]] --- 参考文献
    - [[./tutorial/tutorial.mkv][*tutorial.mkv*]] --- 20分钟视频教程

* 各文件的使用说明
** swfuthesis.cls
   - 通常你不需要改动 [[./swfuthesis.cls][~swfuthesis.cls~]] 文件，将 =\documentclass{swfuthesis}= 做为TeX文件的开始即可。
   - 写论文时，请参照 [[./tutorial/tutorial.tex][~tutorial.tex~]] 文件的开始部分。
** tutorial --- 一个可以当模板用的小教程
- [[file:tutorial/tutorial.tex][*tutorial.tex*]] --- 源文件
  
  编译：
  : latexmk tutorial
  前提是你安装并配置好了 ~latexmk~ 。你可以参考我的 [[https://github.com/wx672/dotfile/blob/master/dot.latexmkrc][~.latexmkrc~]] 文件。


* 注意事项
  1. 不要随意改动你不理解的东西，以免造成不必要的麻烦。
  2. 建议用 ~Emacs + AucTeX~ 来编辑TeX文件。
  3. 如有任何问题或建议，欢迎 [[mailto:wx672ster@gmail.com][email]] 联系。
